Repository: mohammadmahdiyousefi/hamsafar_translator
Catalog: lib/l10n/app_*.arb
Languages: fa

source: Hello!
fa: سلام

source: Translate From
fa: ترجمه از

source: Translate To
fa: ترجمه به

source: Select Language
fa: انتخواب زبان

# translateError
source: Error to load data
fa: خطا در بارگزاری داده ها

# copyMessage
source: Copied to your clipboard !
fa: در کلیپ بورد شما کپی شد!

# translateHintText
source: Enter text
fa: متن را وارد کنید

source: Initialize...
fa: مقداردهی اولیه...

# themeMode
source: Dark
fa: حالت شب

# removeAds
source: Remove interstitial ads
fa: حذف تبلیغ میان صفحه ای

source: Fixed speech bug
fa: رفع مشکل تلفظ و تشخیص گفتار

source: pronunciation settings
fa: تنظیمات تلفظ

source: pronunciation settings on the device
fa: تنظیمات تلفظ در دستگاه

source: Share
fa: اشتراک گذاری

source: Contact Us
fa: ارتباط با ما

# termsandConditions
source: Terms & Conditions
fa: شرایط و ضوابط

source: About
fa: درباره

# themeDivider
source: Theme
fa: تم

# adsDivider
source: Ads
fa: تبلیغات

# speechSettingDivider
source: Speech Settings
fa: تنظیمات گفتار

# communityDivider
source: Community
fa: ارتباط

# helpDivider
source: Help
fa: کمک

# adsAppbartext
source: Ads Remover
fa: حذف تبلیغات

# adsText1
source: By viewing 20 advertising clips, all in-app advertisements will be removed for you.
fa: با مشاهده 20 کلیپ تبلیغاتی تمامی تبلیغات درون برنامه ای برای شما حذف می شود.

# adsText2
source: You can start watching ads by pressing the button below.
fa: می توانید با فشار دادن دکمه زیر شروع به تماشای تبلیغات کنید.

# adsShowButton
source: Watch Ad
fa: تماشای تبلیغات

# noAds
source: Unfortunately, there is currently no advertisement
fa: متاسفانه در حال حاضر هیچ تبلیغی وجود ندارد

# adsAvailable
source: Advertisement is available
fa: تبلیغات موجود است

# numberOfAdsViewed
source: The number of advertisements viewed so far :
fa: تعداد تبلیغات مشاهده شده تا کنون :

# advertisingTerms
source: advertising terms and Conditions
fa: شرایط و ضوابط تبلیغات

# terms1
source: - There may be revisions in the ad removal policy due to policy changes or technical problems
fa: - ممکن است به دلیل تغییر خط مشی یا مشکلات فنی، اصلاحاتی در خط مشی حذف آگهی وجود داشته باشد

# terms2
source: - If you uninstall and reinstall the counter program, the number of ads displayed will be zero
fa: - در صورت حذف و نصب مجدد برنامه شمارنده، تعداد تبلیغات نمایش داده شده صفر خواهد شد

# terms3
source: - In some cases, there may be no advertising clip
fa: - در برخی موارد ممکن است کلیپ تبلیغاتی وجود نداشته باشد

# terms4
source: - If the program is updated, the counter number is still preserved
fa: - اگر برنامه به روز شود، شماره شمارنده همچنان حفظ می شود

# fixedSpeechDiolog
source: If the pronunciation or speech recognition section does not work for you, it may be because Google services are not installed or updated, install and update the speech recognition service as soon as possible.
fa: اگر قسمت تلفظ یا تشخیص گفتار برای شما کار نمی کند، ممکن است به دلیل نصب یا به روز نشدن سرویس های Google باشد، سرویس تشخیص گفتار را در اسرع وقت نصب و به روز کنید.

# fixedSpeechUpdateButton
source: Update & Install
fa: به روز رسانی و نصب

# cancelButton
source: Cancel
fa: لغو

# pronunciationAppBarTitle
source: Pronunciation
fa: تلفظ

# pronunciationPitch
source: Pitch
fa: گام صدا

# pronunciationSpeechRate
source: Speech Rate
fa: نرخ گفتار

# pronunciationVolume
source: Volume
fa: صدا

# pronunciationPlayButton
source: Play
fa: پخش

# pronunciationResetButton
source: Reset
fa: بازنشانی

# contactUsAppBar
source: Contact Us
fa: ارتباط با ما

# emailText
source: E-mail
fa: ایمیل

# telegramText
source: Telegram
fa: تلگرام

# githubText
source: GitHub
fa: گیت هاب

source: Prarivacy Policy
fa: سیاست حفظ حریم خصوصی

# prarivacyPolicyText
source: Your privacy is valuable to us, and to clarify this privacy, especially between us and users, the conditions of using the application (advertisements, privacy, access, etc.) are explained.
fa: حریم خصوصی شما برای ما ارزشمند است و برای روشن شدن این حریم خصوصی به خصوص بین ما و کاربران، شرایط استفاده از اپلیکیشن (تبلیغات، حریم خصوصی، دسترسی و ...) توضیح داده شده است.

source: Show ads
fa: نمایش تبلیغات

# showAdsText
source: The program is completely free, but in order to cover the production and development costs of the software, advertisements are used in the program, which are used to load a small amount of the user's internet.
fa: برنامه کاملا رایگان است اما برای تامین هزینه های تولید و توسعه نرم افزار از تبلیغاتی در برنامه استفاده می شود که برای بارگذاری مقدار کمی از اینترنت کاربر استفاده می شود.

# betterPresentation
source: Better presentation of your service
fa: ارائه بهتر خدمات شما

# betterPresentationText
source: The purpose of collecting information is to provide better services to users. According to these data, it is not possible to match the user's person and the data without the user's request and providing more information. And in fact, this category of information has nothing to do with your personal and individual information. Through the program, this information is sent by the user to the data and statistics servers, such as: model, brand, Android version, information related to device events such as crash and Other parameters used in the program.
fa: هدف از جمع آوری اطلاعات ارائه خدمات بهتر به کاربران است. با توجه به این داده ها، تطبیق شخص کاربر و داده ها بدون درخواست کاربر و ارائه اطلاعات بیشتر امکان پذیر نیست. و در واقع این دسته از اطلاعات هیچ ارتباطی با اطلاعات شخصی و فردی شما ندارد. از طریق برنامه، این اطلاعات توسط کاربر به سرورهای داده و آمار ارسال می شود، مانند: مدل، برند، نسخه اندروید، اطلاعات مربوط به رویدادهای دستگاه مانند خرابی و سایر پارامترهای استفاده شده در برنامه.

source: Right of ownership
fa: حق مالکیت

# rightOfOwnershipText
source: All texts, images and other works in the content of the program are copyrighted and the user has no right to use them without obtaining permission.
fa: کلیه متون، تصاویر و سایر آثار موجود در محتوای برنامه دارای حق چاپ بوده و کاربر حق استفاده از آنها را بدون کسب مجوز ندارد.

source: Application permissions
fa: مجوزهای برنامه

# applicationPermissionsText
source: This app does not require any dangerous permissions.
fa: این برنامه به هیچ مجوز خطرناکی نیاز ندارد.

source: Terms of change
fa: شرایط تغییر

# termsOfChangeText
source: The text of this agreement may change in the future. The program owner reserves the right to change these conditions at any time without giving reasons. We are not obliged to inform the user about this and it is the responsibility of the user to read these conditions again.
fa: متن این قرارداد ممکن است در آینده تغییر کند. مالک برنامه این حق را برای خود محفوظ می دارد که در هر زمان بدون ذکر دلیل، این شرایط را تغییر دهد. ما موظف به اطلاع رسانی در این مورد به کاربر نیستیم و مسئولیت مطالعه مجدد این شرایط بر عهده کاربر است.

source: Bugs and software problems
fa: اشکالات و مشکلات نرم افزاری

# bugsAndSoftwareProblemsText
source: We always seek to solve problems and improve the software, but due to the spread of devices and different versions of Android, the performance of the software may be buggy on some devices or versions, and we apologize for this.
fa: ما همیشه به دنبال رفع مشکلات و بهبود نرم افزار هستیم، اما با توجه به گسترش دستگاه ها و نسخه های مختلف اندروید، ممکن است عملکرد نرم افزار در برخی دستگاه ها یا نسخه ها باگ باشد و از این بابت عذرخواهی می کنیم.

# version
source: App Version
fa: نسخه برنامه

# updateButton
source: Check for update
fa: بررسی نسخه جدید

# settingNavbar
source: Settings
fa: تنظیمات

# conversationNavbar
source: Conversation
fa: مکالمه

# translateNavbar
source: Translate
fa: ترجمه کردن

# succssesShowAd
source: The ad was successfully viewed
fa: تبلیغ با موفقیت دیده شد

# errorViewingTheAd
source: The ad was not successfully viewed
fa: تبلیغ با موفقیت دیده نشد

# languageAppBar
source: Language
fa: زبان

# searchHintText
source: Search
fa: جستجو

source: App Language
fa: زبان برنامه

source: Current version
fa: نسخه فعلی

source: new version
fa: نسخه جدید

source: Update is available
fa: آپدیت در دسترس است

source: * what's new *
fa: * چه خبر *

source: update
fa: بروزرسانی کردن

# currentlyUpdated
source: You are currently updated
fa: در حال حاظر شما بروز هستید
